<!-- 用户服务协议 -->
<template>
  <!-- <el-dialog
    v-loading="loading"
    :width="width"
    :fullscreen="fullscreen"
    :append-to-body="true"
    :visible.sync="showDialog"
    center
    @close="hiddenView"> -->
  <div class="service-wrap">
    <h2>Heycom用户服务协议</h2>
    <p>为使用Heycom软件服务（以下简称“本服务”），您应当阅读并遵守《Heycom用户服务协议》（以下简称“本协议”）以及专项规则等。请您务必审慎阅读、充分理解各条款内容，特别是免除或限制责任的相应条款，以及开通或使用某项服务的单独协议，并选择接受或不接受。限制、免责条款可能以加粗形式提示您注意。</p>

    <p>除非您已阅读并接受本协议所有条款，否则您无权使用Heycom软件服务。您对本服务的注册、登录、填写信息、查看、绑定号码并发起外呼等行为即视为您已阅读并同意本协议的约束。</p>

    <p>如果您未满18周岁，请在法定监护人的陪同下阅读本协议及其他上述协议，并特别注意未成年人使用条款。</p>

    <h3>一、协议的范围</h3>

    <p>1.1 本协议是您与Heycom之间关于您使用Heycom用户服务所订立的协议。“Heycom”是指浙江合亿通信技术有限公司及其相关服务可能存在的运营关联单位。“用户”是指注册、登录、使用Heycom软件的个人或组织，在本协议中更多地称为“您”。</p>

    <p>1.2 本协议的内容包括以下条款及Heycom已经发布的或将来可能发布的各项规则，所有规则为本协议不可分割的一部分，与协议正文具有同等法律效力。本协议是您与Heycom共同签订的，适用于您在Heycom的全部活动。在您注册成为用户时，您已经阅读、理解并接受本协议的全部条款及各项规则，并承诺遵守中国的各类法律、法规、政策的规定，如有违反而导致任何法律后果的发生，您将以自己的名义独立承担所有相应的法律责任。</p>

    <p>1.3 Heycom有权根据相关法律、法规、政策的要求及提供服务的需要不时地修改本协议或根据本协议制定、修改各类具体规则并在Heycom相关系统版块发布，请您适时注意本协议及具体规则的变更。若您在本协议及具体规则内容公告变更后继续使用本服务的，表示您已经阅读、理解并接受修改后的协议和具体规则内容，也将遵循修改后的协议和具体规则使用Heycom的服务；同时就您在协议和具体规则修订前通过Heycom进行的交易及其效力，视为您已同意并已按照本协议及有关规则进行了相应的授权和追认。若您不同意修改后的协议内容，您应立即停止使用Heycom相关的服务。</p>

    <p>1.4 您通过自行或授权有关方根据本协议及Heycom有关规则、说明操作确认本协议后，本协议即在您和Heycom之间产生法律效力。本协议不涉及您与Heycom的其他用户之间因网上交易而产生的法律关系或法律纠纷。</p>

    <h3>二、注册</h3>

    <p>2.1 在您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，或您以其他Heycom允许的方式实际使用Heycom服务时，您即受本协议的约束。您可以使用您提供或确认的手机号码或者Heycom允许的其它方式作为登录手段进入Heycom。</p>

    <p>2.2 您了解并同意，如您系在Heycom官网完成的注册程序，只要您注册成功，您即可以获得您的登录名。您在此明确授权，您的账户信息在您注册成功时，已授权给Heycom使用，以使您更便捷地使用Heycom服务。</p>

    <p>2.3 您了解并同意，为了帮助您更好地使用Heycom旗下所有软件产品的服务，Heycom有权获取您及您的用户方如下信息：您和您的用户提供的联系人姓名、手机号、地址以及您和您的用户在享受软件服务过程中产生的其他类信息。您同意Heycom及Heycom的合作方可以使用以上信息进行相关分析、改善Heycom旗下所有软件产品的内容，并使相关软件产品的内容、设计和服务更能符合用户的需求。</p>

    <p>2.4 您可以对账户设置昵称，但您设置的昵称不得侵犯或涉嫌侵犯他人合法权益。如您设置的昵称涉嫌侵犯他人合法权益，Heycom有权终止向您提供服务，并注销您的账户。账户注销后，相应的昵称将开放给其他有权用户登记使用。</p>

    <p>2.5 您应当妥善保管用户名和密码，且需对用户名和密码的安全负全部责任，同时对以用户名进行的所有活动和事件负全责。</p>

    <h3>三、用户使用规范</h3>

    <p>您理解并同意，您不得利用Heycom帐号制作、复制、发布、传播、如下干扰Heycom正常运营，以及侵犯其他用户或第三方合法权益的内容：</p>

    <p>3.1 发布、传送、传播、储存违反国家法律法规禁止的内容：</p>

    <p>（1）违反宪法确定的基本原则的；</p>
    <p>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>

    <p>（3）损害国家荣誉和利益的；</p>

    <p>（4）煽动民族仇恨、民族歧视，破坏民族团结的；</p>

    <p>（5）破坏国家宗教政策，宣扬邪教和封建迷信的；</p>

    <p>（6）散布谣言，扰乱社会秩序，破坏社会稳定的；</p>

    <p>（7）散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；</p>

    <p>（8）侮辱或者诽谤他人，侵害他人合法权益的；</p>

    <p>（9）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；</p>

    <p>（10）以非法民间组织名义活动的；</p>

    <p>（11）含有法律、行政法规禁止的其他内容的。</p>

    <p>3.2 发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容；</p>

    <p>3.3 涉及他人隐私、个人信息或资料的内容；</p>

    <p>3.4 发表、传送、传播骚扰信息、广告信息及垃圾信息或含有任何性或性暗示的内容；</p>

    <p>3.5 其他违反法律法规、政策及公序良俗、社会公德或干扰Heycom正常运营和侵犯其他用户或第三方合法权益内容的信息。</p>

    <h3>四、用户隐私制度</h3>

    <p>4.1尊重用户个人隐私是Heycom的一项基本政策。Heycom保证不对外公开、编辑或透露用户的注册资料及保存在“Heycom”各项服务中的非公开内容但下列情况除外:</p>

    <p>（1）事先获得用户的书面明确授权；</p>

    <p>（2）根据有关法律法规的要求；</p>

    <p>（3）按照相关政府主管部门的要求；</p>

    <p>（4）为维护社会公众利益；</p>

    <p>（5）为维护“Heycom”的合法权益；</p>

    <p>（6）Heycom认为必要的其他情况下。</p>

    <p>4.2用户在注册帐号或使用本服务的过程中，需要提供一些必要的信息，例如：为向用户提供帐号注册服务或进行用户身份识别，需要填写手机号码；手机通讯录匹配功能需要用户授权访问手机通讯录等。若国家法律法规或政策有特殊规定的，用户需要提供真实的身份信息。若用户提供的信息不完整，则无法使用本服务或在使用过程中受到限制。</p>

    <p>4.3用户个人信息包括：1）用户自行提供的用户个人信息（如注册时填写的手机号码，电子邮件等个人信息，使用服务时提供的共享信息等）；2）其他方分享的用户个人信息；3）Heycom为提供服务而合法收集的用户必要个人信息（如使用服务时系统自动采集的设备或软件信息，浏览历史信息，通讯时间信息等技术信息，用户开启定位功能并使用服务时的地理位置信息等）。</p>

    <p>其中个人隐私信息是指涉及用户个人身份或个人隐私的信息，比如，用户真实姓名、身份证号、手机号码、手机设备识别码、IP地址。非个人隐私信息是指用户对本服务的操作状态以及使用习惯等明确且客观反映在Heycom服务器端的基本记录信息、个人隐私信息范围外的其它普通信息，以及用户同意公开的上述隐私信息。Heycom保证在取得用户书面同意的情况下收集、使用或公开用户的个人隐私信息，用户同意Heycom无需获得用户的另行确认与授权即可收集、使用或公开用户的非个人隐私信息。</p>

    <p>4.4 Heycom重视对未成年人个人信息的保护。Heycom将依赖用户提供的个人信息判断用户是否为未成年人。任何18岁以下的未成年人注册帐号或使用本服务应事先取得家长或其法定监护人（以下简称"监护人"）的书面同意。除根据法律法规的规定及有权机关的指示披露外，Heycom不会使用或向任何第三方透露未成年人的聊天记录及其他个人信息。除本协议约定的例外情形外，未经监护人事先同意，Heycom不会使用或向任何第三方透露未成年人的个人信息。</p>

    <h3>五、Heycom服务内容</h3>

    <p>5.1 Heycom为您提供相关网络环境和技术支持。</p>

    <p>5.2 Heycom有权对您的注册数据及交易行为进行查阅，发现注册数据或交易行为中存在任何问题，均有权向您发出询问或要求改正的通知，或者直接作出删除等处理。</p>

    <p>5.3 对于您通过Heycom后台发布的违法违规信息，包括但不限于本协议第3.1条，Heycom有权在不通知您的前提下进行删除或采取其它限制性措施。</p>

    <h3>六、知识产权</h3>

    <p>6.1 Heycom在本服务中提供的内容（包括但不限于网页、文字、图片、音频、视频、图表等）的知识产权归Heycom所有，用户在使用本服务中所产生的内容的知识产权归用户或相关权利人所有。</p>

    <p>6.2 除另有特别声明外，Heycom提供本服务时所依托软件的著作权、专利权及其他知识产权均归Heycom所有。</p>

    <p>6.3 Heycom在本服务中所使用的“Heycom”、Heycom相关软件图标及LOGO、Heycom相关功能的图标及LOGO等商业标识，其著作权或商标权归Heycom所有。</p>

    <p>6.4 上述及其他任何本服务包含的内容的知识产权均受到法律保护，其他未经Heycom、用户或相关权利人许可的第三人，不得以任何形式进行使用或创造相关衍生作品。</p>

    <p>6.5 任何未经Heycom书面同意及权利人许可的非法获取行为，均属违法侵权行为。您确认并同意，为及时、有效地保障您基于本服务的合法权益，您授权Heycom在发现您的合法权益（包括但不限于信息网络传播权、著作权等）可能受到侵害时，有权代为向涉嫌侵权的第三人采取法律手段进行维权，授权采取的法律手段包括但不限于发函警告、提起诉讼、申请仲裁、移送侦查机关处理等。</p>

    <h3>七、责任限制和免责</h3>

    <p>7.1鉴于网络服务的特殊性，您同意Heycom会变更、中断部分或全部的网络服务，并按本协议规定删除您在使用服务中提交的任何资料，而无需通知您，也无需承担任何责任。</p>

    <p>7.2 您承诺向Heycom及Heycom合作方提供的您方及您方用户资料（包括但不限于：姓名、地址、手机号等）真实、准确、完整及有效，符合中华人民共和国有关法律法规的规定，获得完全授权且不存在侵犯任何第三方合法权益的行为。若您冒用、盗用他人信息所导致的一切后果，由您个人承担。若因您的违法违规行为，导致Heycom或Heycom的合作方陷入争议或诉讼纠纷，您应向Heycom或Heycom的合作方赔偿一切实际损失。</p>

    <p>7.3 您理解并同意，因业务发展需要，Heycom保留单方面对本服务的全部或部分服务内容在任何时候不经任何通知的情况下变更、暂停、限制、终止或撤销的权利，用户需承担此风险。</p>

    <p>7.4 用户在使用本服务时，须自行承担如下Heycom不可掌控的风险内容，包括但不限于：</p>

    <p>（1）由于受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏等不可抗拒因素可能引起的信息丢失、泄漏等风险；</p>

    <p>（2）用户或Heycom的电脑软件、系统、硬件和通信线路出现故障；</p>

    <p>（3）用户操作不当使用本服务；</p>

    <p>（4）其他Heycom无法控制或合理预见的情形。</p>

    <p>7.5 Heycom依据本协议约定获得处理违法违规内容或行为的权利，该权利不构成Heycom的义务或承诺，Heycom不能保证及时发现违法违规情形或进行相应处理。</p>

    <p>7.6 若Heycom发现您因包括但不限于组织机构解散、注销、被吊销等任何原因导致民事行为能力、民事权利能力终止的情况，为保障用户和其他主体的合法权益，将有权决定立即终止本服务，且无需承担任何责任。</p>

    <h3>八、通知</h3>

    <p>8.1 您应当准确填写并及时更新您提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，以便Heycom或其他用户与您进行有效联系，因通过这些联系方式无法与您取得联系，导致您在使用Heycom服务过程中产生任何损失或增加费用的，应由您完全独自承担。</p>

    <p>8.2 您了解并同意，您有义务保持您提供的联系方式的有效性，如有变更需要更新的，您应按Heycom的要求进行操作。</p>

    <h3>九、法律适用、管辖及其他</h3>

    <p>9.1 本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国大陆地区法律，如无相关法律规定的，则应参照通用国际商业惯例和（或）行业惯例。</p>

    <p>9.2 本协议无意结成或创设任何代理、合伙、合营、雇佣与被雇佣或特性授权与被授权关系。</p>

    <p>9.3 您同意Heycom因经营业务需要有权将本协议项下的权利义务就部分或全部进行转让，而无须再通知予您并取得您的同意。</p>

    <p>9.4 因本协议或Heycom服务所引起或与其有关的任何争议应向Heycom所在地人民法院提起诉讼。</p>

    <p>9.5 本协议取代您和Heycom先前就相同事项订立的任何书面或口头协议。倘若本协议任何条款被裁定为无效或不可强制执行，该项条款应被撤销，而其余条款应予遵守和执行。条款标题仅为方便参阅而设，并不以任何方式界定、限制、解释或描述该条款的范围或限度。Heycom未就您或其他人士的某项违约行为采取行动，并不表明Heycom撤回就任何继后或类似的违约事件采取行动的权利。</p>
    <div class="dialog-footer">
      <el-button type="primary" @click="alreadyRead">已阅读</el-button>
    </div>
  </div>
  <!-- </el-dialog> -->
</template>

<script>
import { agreement } from '@/api/login'
export default {
  // props: {
  //   width: {
  //     type: String,
  //     default: '450px'
  //   },
  //   fullscreen: {
  //     type: Boolean,
  //     default: false
  //   },
  //   show: {
  //     type: Boolean,
  //     default: false
  //   }
  // },
  data() {
    return {
      // loading: false,
      // showDialog: false
    }
  },

  // watch: {
  //   show: {
  //     handler(val) {
  //       this.showDialog = val
  //     },
  //     deep: true,
  //     immediate: true
  //   }
  // },

  created() {
    // agreement().then(res => {
    //   console.log(res);
    // })
  },

  methods: {
    alreadyRead() {
      this.$router.back(-1)
    }
    // hiddenView() {
    //   this.$emit('close')
    // }
  }
}
</script>
<style lang='scss' scoped>
.service-wrap {
  overflow: auto;
  padding: 30px;
}
.dialog-footer {
  text-align: center;
}
h2 {
  text-align: center;
  margin-bottom: 30px;
}
h3 {
  margin-bottom: 15px;
}
p {
  line-height: 22px;
  margin-bottom: 10px;
}
</style>
